# DATA 225 Assignment 5

## Sungwon Lee
## 017473950

In [1]:
import mysql.connector
import pandas as pd
from configparser import ConfigParser
from DATA225utils import make_connection, dataframe_query

In [2]:
conn = make_connection(config_file='ZAGI.ini')

In [3]:
cursor = conn.cursor()

### SQL practice #2

1. [10 points] Display the region ID, region name, and number of stores in the \
region for all regions

In [4]:
sql = """Select r.region_id as 'region ID', r.region_name as 'region name', count(s.region_id) as 'number of stores'
            From region r, store s
            Where r.region_id = s.region_id
            Group by r.region_id"""


_, df = dataframe_query(conn, sql)
display(df)

  region ID  region name  number of stores
0         C  Chicagoland                 2
1         T     Tristate                 1

2. [10 points] For each product category, display the category ID, category name,
and average price of a product in the category.

In [5]:
sql = """
    Select c.category_id as 'category ID', c.category_name as 'category name', AVG(p.product_price) as 'average price'
        From category c, product p
        Where c.category_id = p.category_id
        Group by c.category_id
        """

_, df = dataframe_query(conn, sql)
display(df)

  category ID category name average price
0          CP       Camping    166.666667
1          FW      Footwear     58.333333

3. [10 points] For each product category, display the category ID and the total \
number of items purchased in the category.

In [6]:
sql  = """
        Select c.category_id as 'cateogory id', SUM(s.no_of_items) as 'Total number of items purchased'
            From category c, product p, sold_via s
            Where c.category_id = p.category_id AND p.product_id = s.product_id
            Group by c.category_id
        """


_, df = dataframe_query(conn, sql)
display(df)

  cateogory id Total number of items purchased
0           CP                               5
1           FW                              13

4. [10 points] Display the TID and the total number of items (of all products) sold \
within the transaction for all sales transactions whose total number of items (of all \
products) sold within the transaction is greater than five.

In [7]:
sql = """Select tid as 'TID', SUM(no_of_items) as 'Total number of items sold'
            From sold_via
            Group By tid
            Having SUM(no_of_items) > 5 """

_, df = dataframe_query(conn, sql)
display(df)

    TID Total number of items sold
0  T333                          6
1  T555                          7

5. [10 points] Display the product ID and ProductName of the cheapest product.

In [8]:
sql = """ Select product_id as 'product ID', product_name as 'Product Name'
            From product
            Order By product_price ASC
            Limit 1"""

_, df = dataframe_query(conn, sql)
display(df)

  product ID Product Name
0        3X3    Cosy Sock

6. [10 points] Display the product ID for the product that has been sold the most \
(i.e., that has been sold in the highest quantity).

In [9]:
sql  = """ Select t.product_id as 'product ID'
                From (Select p.product_id, SUM(s.no_of_items) as 'totalsold', DENSE_RANK() OVER(ORDER BY SUM(s.no_of_items) DESC) as 'Rank'
                From product p, sold_via s
                Where p.product_id = s.product_id
                Group By p.product_id) t
                Where t.Rank = 1"""

_, df = dataframe_query(conn, sql)
display(df)

  product ID
0        3X3
1        4X4

7. [20 points] Rewrite the following query using a join instead of the nested query. \
Your rewritten query should produce the same results.

In [10]:
sql = """Select p.product_id, p.product_name, p.product_price
            From product p
            LEFT JOIN sold_via as s
            ON p.product_id = s.product_id 
            Group By p.product_id
            HAVING SUM(s.no_of_items) > 3"""

_, df = dataframe_query(conn, sql)
display(df)

  product_id product_name product_price
0        3X3    Cosy Sock         15.00
1        4X4    Dura Boot         90.00

8. [20 points] Rewrite the following query using a join instead of the nested query. \
Your rewritten query should produce the same results.

In [11]:
sql = """
        Select p.product_id, p.product_name, p.product_price
            From product p
            LEFT JOIN sold_via as s
            ON p.product_id = s.product_id
            Group By p.product_id
            HAVING COUNT(*) > 1 """

_, df = dataframe_query(conn, sql)
display(df)

  product_id product_name product_price
0        1X1      Zzz Bag        100.00
1        2X2    Easy Boot         70.00
2        4X4    Dura Boot         90.00